""""
作者：blithe
时间：23.10.16
作用：文件的综合案例
"""
f = open('F:/PythonLearn/文件操作/bill.txt','w',encoding='UTF-8')
f.write("""name, date,money, type, remarks
周杰轮,2022-01-01,100000,消费,正式
周杰轮,2022-01-02,300000,收入,正式
周杰轮,2022-01-03,100000,消费,测试
林俊节,2022-01-01,300000,收入,正式
林俊节,2022-01-02,100000,消费,测试
林俊节,2022-01-03,100000,消费,正式
林俊节,2022-01-04,100000,消费,测试
林俊节,2022-01-05,500000,收入,正式
张学油,2022-01-01,100000,消费,正式
张学油,2022-01-02,500000,收入,正式
张学油,2022-01-03,900000,收入,测试
王力鸿,2022-01-01,500000,消费,正式
王力鸿,2022-01-02,300000,消费,测试
王力鸿,2022-01-03,950000,收入，正式
刘德滑,2022-01-01,300000,消费,测试
刘德滑,2022-01-02,100000,消费,正式
刘德滑,2022-01-03,300000,消费,正式
    """)
f.close()
with open('F:/PythonLearn/文件操作/bill.txt.bak','w',encoding='UTF-8') as f1:
    f = open('F:/PythonLearn/文件操作/bill.txt', 'r', encoding='UTF-8')
    for i in f:
        list = i.strip().split(',')
        for item in list:
            if item == 'remarks':
                f1.write(i)
            elif item == '正式':
                f1.write(i)

    f.close()